import React from "react";
import { Link } from "react-router-dom";
import RequestDetail from "./RequestDetail";
const TravelingReport = () =>{


    return (
        <div className="border border-borderGray rounded-md pt-10 px-5 py-5 mt-7">
             <div className="w-full flex justify-end">
            <div className="px-10 w-max h-[40px] rounded-3xl text-white font-IRsans bg-mainColor flex justify-center items-center font-bold">
                در حال سفر
            </div>
            </div>
            <div className="border-b border-b-borderGray">
            <RequestDetail/>
            </div>

            <div className="mt-20">
            <p className="font-IRsans text-base font-bold text-[#0D296E]">
                        گزارش یک
                      
            </p>
            <br/>
            <p className="font-IRsans text-xs font-medium text-black leading-8">
                       در روز اول مذاکره با ارگان دولتی کشور مقصد وارد مذاکره شدیم و به نتیجه ای نرسیدیم
                       پاسخ به این سوال از یک زاویه خیر و از منظری دیگر بله است. اگر سفر رییس‌جمهور چین به ایران در بهمن ماه 1394 را مبدا زمانی آغاز تلاش‌های دو کشور برای رسیدن به سند همکاری‌های راهبردی جامع فرض کنیم که شواهد نیز با این فرضیه در تطابق است می‌توان گفت که اراده تهران و پکن برای توسعه رابطه تحت تاثیر ناامیدی از غرب در سایه خروج ایالات متحده از برجام نبوده است.

                        رییس‌جمهور چین یک هفته پس از اجرای برجام و در حالی که کمپانی‌های اروپایی در سبقت با چین و روسیه برای ورود به ایران بودند در دیدار با همتای ایرانی بحث چارچوب‌دار کردن رابطه را مطرح کرد. بنابراین می‌توان گفت که اتفاقا در روزهای رونق برجام بود که تهران و پکن در مسیر تعریف نقشه راهی برای رابطه 25 ساله پیش رو قرار گرفتند.

                        اما آیا این اراده در نتیجه بدعهدی‌های غرب سرعت عمل بیشتری به خود نگرفت؟ پاسخ قطعا بله است. زمانی که کشوری تحت تحریم‌های یک‌جانبه‌ای قرار می‌گیرد که ماهیت تنبیه فرامرزی دارند طبیعتا در انتخاب شریک طولانی‌مدت علاوه بر نیازهای اقتصادی، شرایط جوی بازار جهانی باید شرایط تحریمی خود را هم مدنظر بگیرد. نیاز امروز ما در برخی حوزه‌های حیاتی تا 90% توسط چین تامین می‌شود و چین تنها کشوری است که به‌رغم تحریم‌ها هنوز سهمی ولو اندک در خرید نفت از ایران دارد.

                        یکی از دلایل مخالفت‌ها با سند همکاری چین و ایران که بدون اطلاع از حتی یک بند این سند، کلیشه جاافتاده در ذهن ایرانی است که چین و روسیه از تحریم در ایران سود برده‌اند و اتفاقا چینی‌ها در یک دهه گذشته کم و بیش مانند کشورهای غربی رفتار کرده‌اند و از پروژه‌هایی که در ایران برعهده گرفته ‌بودند، عقب نشستند. کلیشه‌ای که اتفاقا مصداق‌های بسیاری هم در تایید آن وجود دارد اما در برابر این واقعیت غیرقابل انکار این اتفاق اثبات شده هم وجود داشته و دارد که غرب در مقاطعی نخواسته یا نتوانسته با ایران همکاری بلندمدت یا حتی میان مدت متداوم داشته باشد.
            </p>
            <div className="flex flex-wrap items-center">
                <div className="flex ml-5 items-center bg-lightBlue px-6 h-[45px] justify-center">
                    <span className="text-white font-IRsans text-xs font-medium">
                        فایل گزارش اولیه سفر من.pdf
                    </span>
                    
                </div>
            </div>
            </div>

          
           
        </div>
    )
}
export default TravelingReport;